app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "title", "updated_at", "content", "published_at") VALUES('2009-10-05 06:18:10', 'test', '2009-10-05 06:18:10', 'test32', '2009-10-05 06:18:00')